# 잘못된 데이터 처리하기

In [1]:
import numpy as np
import pandas as pd

In [3]:
df = pd.DataFrame({'A' : [1, 2, np.nan],
                   'B' : [5, np.nan, np.nan],
                   'C' : [1, 2, 3]})

In [4]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

## 1. 잘못된 값 지우기

In [6]:
# 없는 값 걸러내기 : dropna()
# 행을 기준으로 nan이 있는 행을 삭제
df.dropna()

     A    B  C
0  1.0  5.0  1

In [8]:
# 열을 기준으로 nan이 있는 열 삭제
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [11]:
# 한계값을 지정하여 삭제
# nan이 2개 이상 포함된 행 삭제
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

## 2. 잘못된 값 대체하기

In [12]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [13]:
df.fillna(value = '0')

     A    B  C
0  1.0  5.0  1
1  2.0    0  2
2    0    0  3

In [15]:
# 잘못된 값을 평균값으로 채우기
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64